model {
  faster_rcnn {
    number_of_stages: 3
    num_classes: 90
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 256
        max_dimension: 512
      }
    }
    feature_extractor {
      type: "faster_rcnn_mobilenet_v1"
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        height_stride: 16
        width_stride: 16
        scales: 0.25
        scales: 0.5
        scales: 1.0
        scales: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 1.0
        aspect_ratios: 2.0
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.00999999977648
        }
      }
    }
    first_stage_nms_score_threshold: 0.300000011921
    first_stage_nms_iou_threshold: 0.699999988079
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        use_dropout: false
        dropout_keep_probability: 1.0
        conv_hyperparams {
          op: CONV
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.00999999977648
            }
          }
        }
        predict_instance_masks: true
        mask_prediction_conv_depth: 0
        mask_height: 15
        mask_width: 15
        mask_prediction_num_conv_layers: 2
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.300000011921
        iou_threshold: 0.600000023842
        max_detections_per_class: 100
        max_total_detections: 300
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_prediction_loss_weight: 4.0
  }
}
train_config {
  batch_size: 1
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  keep_checkpoint_every_n_hours: 1
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.0010000000475
          schedule {
            step: 300000
            learning_rate: 9.99999974738e-05
          }
          schedule {
            step: 900000
            learning_rate: 9.99999974738e-06
          }
          schedule {
            step: 1200000
            learning_rate: 9.99999997475e-07
          }
          schedule {
            step: 2000000
            learning_rate: 1.00000001169e-07
          }
        }
      }
      momentum_optimizer_value: 0.899999976158
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/home/gustav/workspace/tensorflow/training/checkpoints/mask_rcnn_mobilenet_v1_coco/train/model.ckpt-826574"
  from_detection_checkpoint: true
}
train_input_reader {
  label_map_path: "/home/gustav/workspace/tensorflow/training/dataset/coco_label_map.pbtxt"
  load_instance_masks: true
  tf_record_input_reader {
    input_path: "/home/gustav/workspace/tensorflow/training/dataset/coco_train.record"
  }
  mask_type: PNG_MASKS
}
eval_config {
  num_examples: 5000
  eval_interval_secs: 1800
  visualization_export_dir: "/home/gustav/workspace/tensorflow/training/visualization"
  use_moving_averages: false
  visualize_groundtruth_boxes: true
}
eval_input_reader {
  label_map_path: "/home/gustav/workspace/tensorflow/training/dataset/coco_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  load_instance_masks: true
  tf_record_input_reader {
    input_path: "/home/gustav/workspace/tensorflow/training/dataset/coco_val.record"
  }
  mask_type: PNG_MASKS
}
